#include <iostream>
using namespace std;

// Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки. Храната се 
// пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки
// струва 4 лв.

// От конзолата се четат 2 реда:
// 1. Броят на опаковките храна за кучета – цяло число в интервала[0… 100]
// 2. Броят на опаковките храна за котки – цяло число в интервала[0… 100]


int main()
{
    double foodDogs;
    cin >> foodDogs;

    double foodCats;
    cin >> foodCats;

   
    
    double allSum = foodDogs * 2.50 + foodCats * 4;

    cout << allSum << " lv.";

    return 0; 
}

